src/ex_Tabakon/DataProcessors/ПочинитьВыемку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПочинитьВыемку</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/AccumulationRegisters/ДенежныеСредстваККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДенежныеСредстваККМ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/ПочинитьВыемку/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПочинитьВыемкуНаСервере()
	
	//Сумма в ККТ
	Попытка
		Fptr = ПодключитьВнешнююКомпоненту("AddIn.Fptr10");
		Fptr = Новый COMобъект("AddIn.Fptr10");
		Fptr.open();
		
		Если не Fptr.isOpened() тогда
			Сообщить("Не удалось подключиться к ККТ. Возможно занят порт. ");	
			Возврат;		
		КонецЕсли;
		
		Fptr.setParam(Fptr.LIBFPTR_PARAM_DATA_TYPE, Fptr.LIBFPTR_DT_STATUS);
		Fptr.queryData();

		Если  Fptr.getParamInt(Fptr.LIBFPTR_PARAM_SHIFT_STATE) <> Fptr.LIBFPTR_SS_CLOSED  тогда
			Сообщить("Сначала закройте смену. ");	
			Возврат;   	
		КонецЕсли;
		
	
		Fptr.setParam(Fptr.LIBFPTR_PARAM_DATA_TYPE, Fptr.LIBFPTR_DT_CASH_SUM);
		Fptr.queryData();

		СуммаККТ = Fptr.getParamDouble(Fptr.LIBFPTR_PARAM_SUM);
		
		Fptr.close();
	Исключение
		Сообщить("Не удалось получить сумму в ККТ: "+ОписаниеОшибки());	
		Возврат;
	КонецПопытки;
	
	//Сумма В 1с
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ДенежныеСредстваККМОстатки.СуммаОстаток КАК Сумма,
	      	 	             |	ДенежныеСредстваККМОстатки.КассаККМ КАК КассаККМ
	      	 	             |ИЗ
	      	 	             |	РегистрНакопления.ДенежныеСредстваККМ.Остатки КАК ДенежныеСредстваККМОстатки
	      	 	             |ГДЕ
	      	 	             |	ДенежныеСредстваККМОстатки.СуммаОстаток > 0");
	Рез = Запрос.Выполнить().Выгрузить();
	Сумма1с = 0;
	Если Рез.Количество() > 0 тогда
		Сумма1с	=	Рез[0].Сумма;	
	КонецЕсли;
	
	Разница = Сумма1с - СуммаККТ;
	
	Если Разница <= 0 тогда
		Сообщить("Сумма в 1с меньше либо равна сумме в ККТ. Починка не требуется ");	
		Возврат;
	КонецЕсли;

	
	//Корректировка
	Если Сумма1с <> СуммаККТ тогда
		Корректировка = Документы.КорректировкаРегистров.СоздатьДокумент();
		Корректировка.Дата			= 	ТекущаяДата();
	
		Рег							= Корректировка.ТаблицаРегистров.Добавить();
		Рег.Имя 					= "ДенежныеСредстваККМ";
		
		Корректировка.Комментарий = "Создан через обработку Починить выемку";
		
		
		СтрокаРег	=	Корректировка.Движения.ДенежныеСредстваККМ.Добавить();
		
		СтрокаРег.Регистратор	=	Корректировка;
		СтрокаРег.ВидДвижения	=	ВидДвиженияНакопления.Расход;	
		СтрокаРег.Активность	=	Истина;
		СтрокаРег.Период		=	ТекущаяДата();
		
		СтрокаРег.КассаККМ	=	Рез[0].КассаККМ;
		СтрокаРег.Сумма		=	Разница;
		
		Попытка
			Корректировка.Записать(); 		
			Сообщить("Выемка починена! Записана корректировка "+Корректировка);
		Исключение
			Сообщить("Не удалось записать корректировку: "+ОписаниеОшибки());
		КонецПопытки;
		
	иначе
		Сообщить("Все хорошо. Суммы совпадают!");
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПочинитьВыемку(Команда)
	ПочинитьВыемкуНаСервере();
КонецПроцедуры
